EWSEditor/EwsPostExamples/CreateOrUpdateFocusedOtherOverride -  Edit or Create a Focused Inbox override rule and set it to Other.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:m="http://schemas.microsoft.com/exchange/services/2006/messages"
    xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types"
    xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header></soap:Header>
  <soap:Body>
    <CreateOrUpdateFocusedOtherOverride xmlns="http://schemas.microsoft.com/exchange/services/2006/messages">
      <SenderSmtpAddress>Bob.Jones@contoso.com</SenderSmtpAddress>
      <SenderDisplayName>Bob Jones</SenderDisplayName>
      <AlwaysClassifyAs>Other</AlwaysClassifyAs>
    </CreateOrUpdateFocusedOtherOverride>
  </soap:Body>
</soap:Envelope>
